//
//  ActualStartView.swift
//  fun
//
//  Created by T Krobot on 29/7/25.
//

import SwiftUI

struct ActualStartView: View {
    var body: some View {
        Text("DO NOT TRANSLATE")
        Text("Ειλικρινά, θέλω απλώς να πεθάνω αυτή τη στιγμή. Έχω κουραστεί τόσο πολύ από τη ζωή και δεν ξέρω πια τι κάνω. Όλοι οι φίλοι μου έχουν τις δικές τους προτεραιότητες και προφανώς εγώ είμαι απλώς η δεύτερη επιλογή και η εφεδρική τους επιλογή. Και αν είμαι εκεί απλώς για να γεμίσω κενά, τότε γιατί είμαι καν εκεί; Θέλω απλώς να πεθάνω. Ίσως βρω γαλήνη. Ίσως μπορέσω να ξεκουραστώ και ίσως να μην φοβάμαι ή να θυμώνω ή να λυπάμαι ή να θυμώνω ή να τελειώνω με τη ζωή. Ίσως τα πράγματα να βελτιωθούν όταν πεθάνω. Ίσως αν καταφέρω καν να μπω στον παράδεισο. Ακόμα κι αν δεν τα καταφέρω και ξεθωριάσω στο σκοτάδι, το σκοτάδι φέρνει γαλήνη και θα είμαι γαλήνιος και θα ξεκουράζομαι επιτέλους χωρίς ανησυχίες. Ίσως είναι καλύτερα για όλους έτσι.")
            .padding()
            .multilineTextAlignment(.center)
        NavigationLink("I assume you're done with this. Let's go back.") {
            StartView()
        }
        NavigationLink("Or maybe you want to go all the way back.") {
            ContentView()
        }
    }
}

#Preview {
    ActualStartView()
}
